<?php



function getMBTI($inl_0,$inl_1,$inl_2,$inl_3,$inl_4,$inl_5,$inl_6,$inl_7,$inl_8,$inl_9,
                 $inl_10,$inl_11,$inl_12,$inl_13,$inl_14,$inl_15,$inl_16,$inl_17,$inl_18,$inl_19){

    $I = 0 ;
    $E = 0;
    $N = 0;
    $S = 0;
    $F = 0;
    $T = 0;
    $P = 0;
    $J = 0;
    if($inl_0 == 0){
        $I += 1;
    }else{
        $E += 1;
    }
    if($inl_1 == 0){
        $I += 1;
    }else{
        $E += 1;
    }
    if($inl_2 == 0){
        $I += 1;
    }else{
        $E += 1;
    }
    if($inl_3 == 0){
        $I += 1;
    }else{
        $E += 1;
    }
    if($inl_4 == 0){
        $I += 1;
    }else{
        $E += 1;
    }
    if($inl_5 == 0){
        $N += 1;
    }else{
        $S += 1;
    }
    if($inl_6 == 0){
        $N += 1;
    }else{
        $S += 1;
    }
    if($inl_7 == 0){
        $N += 1;
    }else{
        $S += 1;
    }
    if($inl_8 == 0){
        $N += 1;
    }else{
        $S += 1;
    }
    if($inl_9 == 0){
        $N += 1;
    }else{
        $S += 1;
    }
    if($inl_10 == 0){
        $F += 1;
    }else{
        $T += 1;
    }
    if($inl_11 == 0){
        $F += 1;
    }else{
        $T += 1;
    }
    if($inl_12 == 0){
        $F += 1;
    }else{
        $T += 1;
    }
    if($inl_13 == 0){
        $F += 1;
    }else{
        $T += 1;
    }
    if($inl_14 == 0){
        $F += 1;
    }else{
        $T += 1;
    }
    if($inl_15 == 0){
        $J += 1;
    }else{
        $P += 1;
    }
    if($inl_16 == 0){
        $J += 1;
    }else{
        $P += 1;
    }
    if($inl_17 == 0){
        $J += 1;
    }else{
        $P += 1;
    }
    if($inl_18 == 0){
        $J += 1;
    }else{
        $P += 1;
    }
    if($inl_19 == 0){
        $J += 1;
    }else{
        $P += 1;
    }
    $result = "";
    if($I >$E){
        $result .= "I";
    }else{
        $result .= "E";
    }
    if($N >$S){
        $result .= "N";
    }else{
        $result .= "S";
    }
    if($F >$T){
        $result .= "F";
    }else{
        $result .= "T";
    }
    if($J >$P){
        $result .= "J";
    }else{
        $result .= "P";
    }
    return $result;

}

function getDescription($result){
    if($result == "ENFP"){

        $description = "اجتماعي، حدسي، عاطفي، تلقائي
        هي شخصية اجتماعية ساحرة محبوبة من قبل الجميع , تنبض بالحيوية والحماس، فهي لا تعرف المستحيل , تتمتع بالخيال الخصب والقادر على الإبداع وحل المشكلات ,
        لديها حنكة تستطيع من خلالها قراءة ما بين السطور , لديها مشكلة مع البرامج الروتينية التي تجعلها تفقد صبرها ,
        تستطيع التحول ما بين الشخصية المثالية في العمل والشخصية الحرة المستقلة خارجه , وهي شخصية حذرة، إلا أنها عاطفية جدًا وحساسة ,
        فوضوية لا تجيد التخطيط لمستقبلها، ولا تنظيم وقتها وهذا ما ينعكس سلبًا على إنتاجها";
    }elseif ($result == "INFP"){

        $description = "متحفظ، حدسي، عاطفي، تلقائي
        أهم ما يميز هذه الشخصية المثالية، فهي تبحث عن الخير في الآخرين، كما تسعى لجعل الأمور دائمًا للأفضل , 
        تتميز بالهدوء الذي يدفعها للتأمل ,
        لديها حدس قوي يمكنها من فهم الآخرين وتكوين نظرة مستقبلية,
        تتمتع بخيال خصب وعاطفة متقدة,
        تتكيف مع أي عمل تكلف به,
        تميل للشعر والأدب والعلوم الإنسانية، ولذلك غالبًا ما تتناسب مع الكتاب والشعراء,
        تمل من الروتين، ولا تجيد تنظيم الوقت ,
        يقودها صفاء النية والأخلاق ولا تتأثر بالمكافآت أو العقوبات";
    }elseif ($result == "ESFP"){

        $description = "ميزتها الأولى حبها للاجتماع بالآخرين,
        تمتلك حس الدعابة والمرح,
        وعلى عكس النوعين السابقين نجدها واقعية حسية بعيدة عن الخيال,
        ليس لديها القدرة على الابتكار,
        تتعلم بالممارسة العملية,
        تحس بمشاعر الآخرين وتقدم لهم المساعدة,
        قمة البهجة عندما تلتقي بأصدقائها أو تكوّن صداقات جديدة,
        يمكنها الحديث لساعات طويلة,
        تهتم بالموضة والشكل، وتحب أن تسلَّط عليها الأضواء,
        تناسب هذه الشخصية المصلحين الاجتماعيين أو موظفي خدمة العملاء";
    }elseif ($result == "ENTP"){

        $description = "اجتماعي، حدسي، عقلاني، تلقائي 
        يطلق على هذه الشخصية اسم “محامي الشيطان” بسبب حبها للجدال ولو من أجل أمر لا تؤمن به,
        أهم ما يميزها هو الأفكار الإبداعية، إلا أنها فاشلة في تطبيق هذه الأفكار,
        تستمتع بممارسة السجال العقلي,
        تجيد عمل الكثير من الأشياء في وقت واحد,
        تحظى بالاحترام من المجتمع لما تتمتع به من معرفة واسعة وفكاهة,
        مستعدة للدخول في نقاش منطقي وعندها القدرة على إقناع الطرف الآخر بالمنطق,
        تحب هذه الشخصية تبادل الأفكار,
        تتمتع بالصدق مع الصراحة المؤلمة للآخرين في بعض الأحيان,
        تكره أن يطلب منها إسداء جميل، لأنها تكره الأشخاص المستعطفين,
        تحب الدخول في المغامرات والتحديات,";
    }elseif ($result == "ENFJ"){

        $description = "اجتماعي، حدسي، عاطفي، حكم
        ,        أهم ما يميز هذه الشخصية أنها ملتحمة مع الجماهير، فهي تحس بمشاعر الآخرين
        شخصية قيادية بالفطرة,
        تتمتع بحماسة معدية. ولا تعرف المستحيل,
        تتأثر برأي الآخر سواء أكان ثناء أم نقد,
        ترتاح عندما توجه الآخرين للعمل معًا,
        تعمل على حل مشاكل الآخرين والاندماج بهم لدرجة أنها ترى مشاكل الآخرين في نفسها,
        تمتلك ملكة الإقناع سواء بالمنطق أو العاطفة,
        شخصية مبدعة مثالية,
        عيوبها أنه تهتم بالعامل أكثر من العمل";
    }elseif ($result == "ISTJ"){

        $description = "متحفظ، حسي، عقلاني، حكم
        أهم ما تتميز به هذه الشخصية الإنجاز والتفاني في العمل. وهذا ما يجعلها عرضة للاستغلال من قبل البعض,
        هادئة، تفضل الاستقلالية والعمل بمفردها,
        منظمة، تعتمد الدقة في المواعيد، وتعد خططًا مفصلة لتسير عليها,
        تلتزم بتطبيق قوانين العمل مهما كانت التكلفة,
        شخصية عملية تركز على الواقع,
        تتهم بالبرود العاطفي إلا أنها في الواقع تعاني من صعوبة التعبير عن المشاعر,
        تحتفظ بآرائها لنفسها، ولا تخوض النقاشات حولها,
        تتحمل المسؤولية، وتنجح في المهام الموكلة لها,
        تعد الاعتماد على الآخرين ضعف في الشخصية، وتأبى كرامتها ذلك";
    }elseif ($result == "ESTJ"){

        $description = "اجتماعي، حسي، عقلاني، حكم
        أهم ما يميز هذه الشخصية الالتزام التام بالتقاليد والنظم,
        شخصية اجتماعية تتواصل مع الآخرين، وقد تسيطر عليهم,
        تتسم بالثقة بالنفس، والقدرة على الإقناع,
        لا تتمتع بالخيال الخصب بل تميل للمنطق,
        تمتلك القدرة على وضع مخططات تفصيلية,
        تمتاز بالتنظيم، ولا تتحمل الفوضى، بل تسعى لتحسين خطط العمل,
        يتسم قرارها بالحزم وعدم مراعاة مشاعر الآخرين,
        تعمل ضمن فريق وتتوقع أن يتصف الجميع بصفاتها,
        يتملكها الغضب عندما تتهم بالكسل أو عدم الكفاءة في العمل,
        تلقى تقديرًا من الآخرين بسبب النصائح التي تقدمها,
        يناسبها تنفيذ القرارات دون اتخاذها؛ لأن قرارها سريع,";
    }elseif ($result == "INTJ"){

        $description = "متحفظ، حدسي، عقلاني، حكم
        تعد هذه الشخصية من أندر الشخصيات لما تتمتع به من قدرة استراتيجية,
        تكره القواعد والتقاليد، وكل فكرة ممكن أن توضع على طاولة البحث ليعاد تقييمها,
        علاقاتها الاجتماعية محدودة، فهي قليلة الكلام,
        تتسم بالثقة بالنفس ويكتنفها الغموض,
        مبدعة، مبتكرة، لديها نظرة مستقبلية ثاقبة,
        تتمتع بالخيال الواسع مع الطموح، وهذا لا ينفي اعتمادها على المنطق الذي يذلل لها الصعاب,
        تتميز بالاستقلالية عن الآخرين وهي بعيد كل البعد عن التقليد,
        ترتبط بالفكرة أكثر من ارتباطها بالمنظمة,
        تتميز بقدرتها على اتخاذ القرارات الصعبة,
        تتميز بالحزم وتحب التحدي.";
    }elseif ($result == "ISFJ"){

        $description = "متحفظ، حسي، عاطفي، حكم
        تتمتع هذه الشخصية بعلاقات اجتماعية قوية، ورغم ذلك هي قليلة الكلامو
        تتسم بقدرتها على العطاء في العمل,
        تستهويها الأعمال التطوعية، والخيرية,
        تستطيع تحمل المسؤولية وضغوط العمل في سبيل إنجاز المهام في الوقت المحدد,
        تستهلك الدقة التي تتحلى بها وقتًا وجهدًا إضافيًا,
        من سماتها التواضع، إلا أنه ينعكس عليها سلبًا حين يستغله البعض,
        تتمتع بالحساسية التي تدفعها دومًا لأن تشعر بالآخرين وتساعدهم,
        تستخدم الخيال، الذي يمكنها من وضع الخطط المستقبلية,
        لا تحب أن تسلط عليها الأضواء، ولكن تتمنى أن يدرك من حولها جهدها المبذول,
        تسعى لتطوير نفسها باستمرار.";
    }elseif ($result == "ISTP"){

        $description = "متحفظ، حسي، عقلاني، تلقائي
        أهم ما يميز هذه الشخصية هو الإبداع والفكاهة,
        تتسم بالهدوء، وهذا ناتج عن الاستقلالية التي تتميز بها,
        تفكيرها العميق يساعدها على كشف المشاكل وإيجاد الحلول المناسبة لها,
        قمة المتعة عندما تبتكر شيء جديد,
        لديها الاستعداد للتعاون مع من يشاركها الاهتمامات بهدف تبادل الخبرات,
        طالما أنها شخصية منطقية فهذا يعني أنها بعيدة عن الخيال مرتبطة بالواقع,
        هي شخصية عملية، لا تحب الثبات، تكره العمل المكتبي وتفضل العمل الميداني,
        تتميز بالبساطة مع الغموض بالإضافة للعفوية التي قد تفهم بشكل خاطئ في بعض الأحيان,
        من عيوب هذه الشخصية سرعة القرار وسرعة ردود الفعل، بالإضافة إلى المعاملة بالمثل,
        لا تمتلك القدرة على اكتشاف عواطف الآخرين,
        يدفعها الفضول للبحث والاستكشاف,
        تحكم على علاقتها بالآخرين من خلال أفعالهم,
        أما علاقتها بالأصدقاء والمقربين فتتسم بالود والإخلاص,
        تناسب هذه الشخصية الميكانيكي والمهندس وأصحاب الأعمال الميدانية.";
    }elseif ($result == "ENTJ"){

        $description = "اجتماعي، حدسي، عقلاني، حكم 
   تمتلك هذه الشخصية مهارات القيادة بالفطرة، وأهم ما يميزها قوة الشخصية,     
        لديها القدرة على قيادة الجماهير نحو هدف محدد,
        تمتلك إرادة قوية لا تعرف المستحيل في سبيل تحقيق الأهداف,
        قادرة على التفاوض، وتمتلك سبل إقناع الطرف الآخر من دهاء وسرعة بديهة,
        تنتقي أفراد فريق العمل بدقة وتعترف بمواهبهم,
        تضع خطة تمكنها من تحقيق الهدف وقابلة للتنفيذ على أرض الواقع,
        من عيوب هذه الشخصية الصراحة الفجة والتي قد تدخلها في مشاكل مع الآخرين,
        تتسم بالعقلانية البحتة، وقد يظنها البعض بلا مشاعر,
        لا تمتلك مقدرة التعبير عن عواطفها، وتعد الاعتراف بالمشاعر ضعف في الشخصية,
        لابد من تذكيرها بأهمية الفريق للوصول للنجاح,
        تناسب هذه الشخصية مؤسسي الشركات ورجال الأعمال الناجحين";
    }elseif ($result == "INFJ"){

        $description = "متحفظ، حدسي، عاطفي، حكم
        تمتلك المثالية والأخلاق التي تدفعها لمساعدة الآخرين,
        تتميز بأنها هادئة، ولكنها في نفس الوقت اجتماعية,
        قد تلجأ للعزلة فجأة ولبعض الوقت,
        تجيد الكلام المنمق، والتواصل مع الآخرين,
        تمتلك فكرة تكون هدفها في الحياة، تسعى لتحقيقها دون كلل أو ملل,
        لديها إرادة قوية وعزيمة,
        شخصية عاطفية تراعي مشاعر الآخرين عند اتخاذ القرار,
        تعمل من أجل البشرية في حربها ضد الظلم وتنسى نفسها.";
    }elseif ($result == "ESFJ"){

        $description = "اجتماعي، حسي، عاطفي، حكم
       تتسم بأنها شخصية اجتماعية، منطلقة، مرحة, 
        لا تهتم بالنظريات والنقاش بالمفاهيم المجردة,
        يستهويها الحديث في الأمور البسيطة مثل المظهر والوضع الاجتماعي ونظرة الآخرين لها,
        تحب تقديم المساعدة للآخرين، كما تحب أن يقدر الشخص الآخر صنيعها,
        شخصية حساسة يسهل جرح مشاعرها,
        تناسبها الأنظمة الروتينية وتتأقلم معها بسهولة. فهي شخصية غير مبتكرة,
        تحتاج للتشجيع كي تقدم الأفضل.";
    }elseif ($result == "INTP"){

        $description = "متحفظ، حدسي، عقلاني، تلقائي
      سمتها الأبرز الأفكار الإبداعية الفريدة,  
        تكتشف المشكلات وتضع لها الحلول المنطقية والقابلة للتطبيق,
        اجتماعيًا تتسم بالخجل عندما تتواجد في مجتمع جديد,
        لا تتقبل المزاح الذي يمس نظرياتها,
        لديها خيال واسع توظفه في إجراء نقاشات منطقية بينها وبين نفسها,
        ترتاح للأشخاص الذين يشاركونها الاهتمام,
        يغلب عليها المنطق ويغطي على العاطفة,
        هاجسها الوحيد هو الفشل,
        لا تناسبها بيئة العمل الروتيني.";
    }elseif ($result == "ESTP"){

        $description = "اجتماعي، حسي، عقلاني، تلقائي
        شخصية اجتماعية جدًا، ولها علاقات واسعة,
        شخصية مرحة، غالبًا ما تسرق الأضواء,
        لا تهتم بالنظريات والأفكار المجردة,
        تفضل الاستمتاع بالحياة سواء بالعمل أو خارجه,
        لا تحب أن يكبلها الروتين بل تفضل العمل بحرية,
        تتمتع بالحيوية وتحب النزول إلى ميدان العمل,
        شخصية تحب المغامرة وتهوى كسر الروتين، وهذا ما قد يخلق المشاكل أحيانًا مع الآخرين,
        قد تناسب هذه الشخصية أصحاب الحرف,
        لديها مقدرة على قراءة لغة الجسد بسهولة، وإدراك دوافعها,
        تمتلك عاطفة تغيب عنها في بعض الأحيان.";
    }elseif ($result == "ISFP"){

        $description = "متحفظ، حسي، عاطفي، تلقائي
       شخصية الفنان الحقيقي، ليس بالضرورة أن يكون رسامًا، وإنما الشخص الذي يمتلك حس فني عالي, 
        شخصية عفوية وقد تبدو غامضة أحيانًا حتى بالنسبة لأقرب الأشخاص منها,
        تستهويها العزلة في بعض الأحيان التي تمكنها من البحث عن ذاتها,
        تتقبل النقد البناء، إلا أنها لا تتحمل النقد غير المنطقي,
        تشعر بمشاعر الآخرين. وقد تتنازل عن حقها في سبيل تجنب المشاكل,
        تتمتع بالتأني وإنجاز الأعمال بهدوء,
        تناسب هذه الشخصية من يعمل في الأعمال اليدوية وفي مجال التصميم.";
    }else{
        echo "there is an error in mbti type";
    }
    return $description;
}
function getTitle($result){
    if($result == "ENFP"){
        $title ="الجماهيري أو المناضل";

    }elseif ($result == "INFP"){
        $title ="الحدسي";

    }elseif ($result == "ESFP"){
        $title ="الاجتماعي";

    }elseif ($result == "ENTP"){
        $title ="الملهم أو المحاور";

    }elseif ($result == "ENFJ"){
        $title ="القائد الجماهيري أو البطل";

    }elseif ($result == "ISTJ"){
        $title ="الجاد أو اللوجستي";

    }elseif ($result == "ESTJ"){
        $title ="الحازم أو التنفيذي";

    }elseif ($result == "INTJ"){
        $title ="القائد المفكر";

    }elseif ($result == "ISFJ"){
        $title ="المربي";

    }elseif ($result == "ISTP"){
        $title ="المنطقي";

    }elseif ($result == "ENTJ"){
        $title ="القائد الملهم";

    }elseif ($result == "INFJ"){
        $title ="القائد الحدسي";

    }elseif ($result == "ESFJ"){
        $title ="مدير العلاقات";

    }elseif ($result == "INTP"){
        $title ="المفكر";

    }elseif ($result == "ESTP"){
        $title ="الحركي";

    }elseif ($result == "ISFP"){
        $title ="الفنان";

    }else{
        echo "there is an error in mbti type";
    }
    return $title ;
}
function colageName($name){
    $collegeName = "";
    if (strlen($name) == 9){
        $collegeName = "كلية طب الأسنان";
    }
    elseif (strlen($name) == 11){
        $collegeName = "كلية ادارة المال والأعمال قسم المحاسبة";
    }
    elseif (strlen($name) == 41){
        $collegeName = "كلية الهندسة والتخطيط العمراني قسم هندسة المعدات الطبية";
    }
    elseif (strlen($name) == 47){
        $collegeName = "كلية الهندسة والتخطيط العمراني قسم هندسة البرمجيات";
    }
    elseif (strlen($name) == 22){
        $collegeName = "كلية تكنولوجيا الوسائط المتعددة";
    }
    elseif (strlen($name) == 28){
        $collegeName = "كلية إدارة وأتمتة المكاتب";
    }
    elseif (strlen($name) == 13){
        $collegeName = "كلية الصيدلة";
    }
    elseif (strlen($name) == 53){
        $collegeName = "كلية التربية قسم اللغة الإنجليزية";
    }
    elseif (strlen($name) == 23){
        $collegeName = "كلية تكنولوجيا المعلومات";
    }
    elseif (strlen($name) == 51){
        $collegeName = "كلية الهندسة والتخطيط العمراني قسم هندسة العمارة";
    }
    elseif ($name == 44){
        $collegeName = "كلية الهندسة والتخطيط العمراني قسم هندسة المدني";
    }
    elseif (strlen($name) == 71){
        $collegeName = "كلية الطب والعلوم الصحية قسم التغذية الصحية";
    }
    elseif (strlen($name) == 19){
        $collegeName = "كلية التمريض";
    }
    elseif (strlen($name) == 52){
        $collegeName = "كلية التربية قسم التعليم الأساسي";
    }
    elseif (strlen($name) == 8){
        $collegeName = "كلية التمريض";
    }
    elseif (strlen($name) == 6){
        $collegeName = "كلية الوسائط المتعددة";
    }
    elseif (strlen($name) == 17){
        $collegeName = "دبلوم متوسط مساعد طبيب الاسنان";
    }
    elseif (strlen($name) == 16){
        $collegeName = "دبلوم متوسط مساعد قانوني";
    }
    elseif (strlen($name) == 31){
        $collegeName = "العلاقات العامة والتسويق";
    }
    elseif (strlen($name) == 35){
        $collegeName = "دبلوم متوسط كلية المحاسبة المحوسبة";
    }
    elseif (strlen($name) == 14){
        $collegeName = "كلية القانون باللغة العربية";
    }
    elseif (strlen($name) == 15){
        $collegeName = "كلية القانون باللغة الإنجليزية";
    }
    elseif (strlen($name) ==76 ){
        $collegeName = "كلية ادارة المال والأعمال قسم الادارة";
    }
    else {
        $collegeName = "اسم الكلية غير متوفر في جامعة فلسطين";
    }
    return $collegeName ;
}
